## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_dashboard.service_dashboard[0] will be updated in-place
  ~ resource "datadog_dashboard" "service_dashboard" {
        id                      = "4jj-dh7-k8z"
        tags                    = []
        # (9 unchanged attributes hidden)

      ~ widget {
            id = 3725388981275872

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 6716687743985386

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "invoke_success" -> "invoke_total - invoke_failure"
                                # (1 unchanged attribute hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invoke_success" -> "invoke_total"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:downloadffisspreadsheet}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,functionname:grants_ingest-downloadffisspreadsheet}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:downloadffisspreadsheet}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-downloadffisspreadsheet}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 2428517807135205

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_duration"
                                  ~ query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:downloadffisspreadsheet}" -> "avg:aws.lambda.duration{$env,$service,$version,functionname:grants_ingest-downloadffisspreadsheet}"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_timeout"
                                  ~ query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:downloadffisspreadsheet}" -> "avg:aws.lambda.timeout{$env,$service,$version,functionname:grants_ingest-downloadffisspreadsheet}"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (2 unchanged blocks hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 3513410265247530

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 7352256030539098

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "invoke_success" -> "invoke_total - invoke_failure"
                                # (1 unchanged attribute hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invoke_success" -> "invoke_total"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:downloadgrantsgovdb}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,functionname:grants_ingest-downloadgrantsgovdb}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:downloadgrantsgovdb}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-downloadgrantsgovdb}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 671374427180476

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_duration"
                                  ~ query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:downloadgrantsgovdb}" -> "avg:aws.lambda.duration{$env,$service,$version,functionname:grants_ingest-downloadgrantsgovdb}"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_timeout"
                                  ~ query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:downloadgrantsgovdb}" -> "avg:aws.lambda.timeout{$env,$service,$version,functionname:grants_ingest-downloadgrantsgovdb}"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (2 unchanged blocks hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 7465598655373307

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 7740537888771851

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "invoke_success" -> "invoke_total - invoke_failure"
                                # (1 unchanged attribute hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invoke_success" -> "invoke_total"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:enqueueffisdownload}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,functionname:grants_ingest-enqueueffisdownload}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:enqueueffisdownload}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-enqueueffisdownload}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 3042520193216785

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_duration"
                                  ~ query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:enqueueffisdownload}" -> "avg:aws.lambda.duration{$env,$service,$version,functionname:grants_ingest-enqueueffisdownload}"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_timeout"
                                  ~ query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:enqueueffisdownload}" -> "avg:aws.lambda.timeout{$env,$service,$version,functionname:grants_ingest-enqueueffisdownload}"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (2 unchanged blocks hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 2293262573424078

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "queue_size"
                                  ~ query       = "sum:aws.sqs.approximate_number_of_messages_visible{$env,$service,$version,queuename:ffis_downloads}.as_count()" -> "sum:aws.sqs.approximate_number_of_messages_visible{$env,$service,$version,queuename:grants_ingest-ffis_downloads}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 3382653521330667

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 4196214770339400

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "invoke_success" -> "invoke_total - invoke_failure"
                                # (1 unchanged attribute hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invoke_success" -> "invoke_total"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:extractgrantsgovdbtoxml}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,functionname:grants_ingest-extractgrantsgovdbtoxml}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:extractgrantsgovdbtoxml}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-extractgrantsgovdbtoxml}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 6429216648912447

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_duration"
                                  ~ query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:extractgrantsgovdbtoxml}" -> "avg:aws.lambda.duration{$env,$service,$version,functionname:grants_ingest-extractgrantsgovdbtoxml}"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_timeout"
                                  ~ query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:extractgrantsgovdbtoxml}" -> "avg:aws.lambda.timeout{$env,$service,$version,functionname:grants_ingest-extractgrantsgovdbtoxml}"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (2 unchanged blocks hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 6360782788111010

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 2068166858603441

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "invoke_success" -> "invoke_total - invoke_failure"
                                # (1 unchanged attribute hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invoke_success" -> "invoke_total"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:persistffisdata}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,functionname:grants_ingest-persistffisdata}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:persistffisdata}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-persistffisdata}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 8631632248639905

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_duration"
                                  ~ query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:persistffisdata}" -> "avg:aws.lambda.duration{$env,$service,$version,functionname:grants_ingest-persistffisdata}"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_timeout"
                                  ~ query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:persistffisdata}" -> "avg:aws.lambda.timeout{$env,$service,$version,functionname:grants_ingest-persistffisdata}"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (2 unchanged blocks hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 8323742108901495

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invocation_total"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:persistffisdata}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,functionname:grants_ingest-persistffisdata}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invocation_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:persistffisdata}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-persistffisdata}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (4 unchanged blocks hidden)
                        }

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 1533975036555171

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 4985270685810215

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "invoke_success" -> "invoke_total - invoke_failure"
                                # (1 unchanged attribute hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invoke_success" -> "invoke_total"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:persistgrantsgovxmldb}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,functionname:grants_ingest-persistgrantsgovxmldb}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:persistgrantsgovxmldb}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-persistgrantsgovxmldb}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 2891149848632835

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_duration"
                                  ~ query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:persistgrantsgovxmldb}" -> "avg:aws.lambda.duration{$env,$service,$version,functionname:grants_ingest-persistgrantsgovxmldb}"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_timeout"
                                  ~ query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:persistgrantsgovxmldb}" -> "avg:aws.lambda.timeout{$env,$service,$version,functionname:grants_ingest-persistgrantsgovxmldb}"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (2 unchanged blocks hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 2203276295422525

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 6023063967476083

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "invoke_success" -> "invoke_total - invoke_failure"
                                # (1 unchanged attribute hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invoke_success" -> "invoke_total"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:publishgrantevents}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,functionname:grants_ingest-publishgrantevents}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:publishgrantevents}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-publishgrantevents}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 2694014736689429

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_duration"
                                  ~ query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:publishgrantevents}" -> "avg:aws.lambda.duration{$env,$service,$version,functionname:grants_ingest-publishgrantevents}"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_timeout"
                                  ~ query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:publishgrantevents}" -> "avg:aws.lambda.timeout{$env,$service,$version,functionname:grants_ingest-publishgrantevents}"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (2 unchanged blocks hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 5780948165079034

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "queue_size"
                                  ~ query       = "sum:aws.sqs.approximate_number_of_messages_visible{$env,$service,$version,queuename:publish_grant_events_dlq}.as_count()" -> "sum:aws.sqs.approximate_number_of_messages_visible{$env,$service,$version,queuename:grants_ingest-publishgrantevents-dlq}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (2 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 6491084707249495

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 3396329991968352

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "invoke_success" -> "invoke_total - invoke_failure"
                                # (1 unchanged attribute hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invoke_success" -> "invoke_total"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:receiveffisemail}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,functionname:grants_ingest-receiveffisemail}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:receiveffisemail}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-receiveffisemail}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 644676084593911

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_duration"
                                  ~ query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:receiveffisemail}" -> "avg:aws.lambda.duration{$env,$service,$version,functionname:grants_ingest-receiveffisemail}"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_timeout"
                                  ~ query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:receiveffisemail}" -> "avg:aws.lambda.timeout{$env,$service,$version,functionname:grants_ingest-receiveffisemail}"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (2 unchanged blocks hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 8000900389504749

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 1989536795734721

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "invoke_success" -> "invoke_total - invoke_failure"
                                # (1 unchanged attribute hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invoke_success" -> "invoke_total"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:splitffisspreadsheet}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,functionname:grants_ingest-splitffisspreadsheet}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:splitffisspreadsheet}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-splitffisspreadsheet}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 8496525377536248

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_duration"
                                  ~ query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:splitffisspreadsheet}" -> "avg:aws.lambda.duration{$env,$service,$version,functionname:grants_ingest-splitffisspreadsheet}"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_timeout"
                                  ~ query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:splitffisspreadsheet}" -> "avg:aws.lambda.timeout{$env,$service,$version,functionname:grants_ingest-splitffisspreadsheet}"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (2 unchanged blocks hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }

                # (3 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 6579373104651032

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 597679914362992

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "invoke_success" -> "invoke_total - invoke_failure"
                                # (1 unchanged attribute hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "invoke_success" -> "invoke_total"
                                  ~ query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:splitgrantsgovxmldb}.as_count()" -> "sum:aws.lambda.invocations{$env,$service,$version,functionname:grants_ingest-splitgrantsgovxmldb}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_failure"
                                  ~ query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:splitgrantsgovxmldb}.as_count()" -> "sum:aws.lambda.errors{$env,$service,$version,functionname:grants_ingest-splitgrantsgovxmldb}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (1 unchanged block hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 6335342562866929

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_duration"
                                  ~ query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:splitgrantsgovxmldb}" -> "avg:aws.lambda.duration{$env,$service,$version,functionname:grants_ingest-splitgrantsgovxmldb}"
                                    # (1 unchanged attribute hidden)
                                }
                            }
                          ~ query {
                              ~ metric_query {
                                    name        = "invoke_timeout"
                                  ~ query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:splitgrantsgovxmldb}" -> "avg:aws.lambda.timeout{$env,$service,$version,functionname:grants_ingest-splitgrantsgovxmldb}"
                                    # (1 unchanged attribute hidden)
                                }
                            }

                            # (2 unchanged blocks hidden)
                        }
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # datadog_monitor.DownloadFFISSpreadsheet-failed[0] will be updated in-place
  ~ resource "datadog_monitor" "DownloadFFISSpreadsheet-failed" {
        id                   = "130337504"
        name                 = "Grants Ingest (Draft - staging): DownloadFFISSpreadsheet failed"
      ~ query                = "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-DownloadFFISSpreadsheet}.as_count() > 0" -> "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-downloadffisspreadsheet}.as_count() > 0"
        tags                 = [
            "env:staging",
            "service:grants-ingest",
            "team:grants",
        ]
        # (16 unchanged attributes hidden)
    }

  # datadog_monitor.DownloadGrantsGovDB-failed[0] will be updated in-place
  ~ resource "datadog_monitor" "DownloadGrantsGovDB-failed" {
        id                   = "130337503"
        name                 = "Grants Ingest (Draft - staging): DownloadGrantsGovDB failed"
      ~ query                = "sum(last_10h):sum:aws.lambda.errors{env:staging,functionname:grants_ingest-DownloadGrantsGovDB}.as_count() / sum:aws.lambda.invocations{env:staging,functionname:grants_ingest-DownloadGrantsGovDB}.as_count() >= 1.0" -> "sum(last_10h):sum:aws.lambda.errors{env:staging,functionname:grants_ingest-downloadgrantsgovdb}.as_count() / sum:aws.lambda.invocations{env:staging,functionname:grants_ingest-downloadgrantsgovdb}.as_count() >= 1.0"
        tags                 = [
            "env:staging",
            "service:grants-ingest",
            "team:grants",
        ]
        # (16 unchanged attributes hidden)
    }

  # datadog_monitor.EnqueueFFISSpreadsheet-failed[0] will be updated in-place
  ~ resource "datadog_monitor" "EnqueueFFISSpreadsheet-failed" {
        id                   = "130337493"
        name                 = "Grants Ingest (Draft - staging): EnqueueFFISSpreadsheet failed"
      ~ query                = "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-EnqueueFFISDownload}.as_count() > 0" -> "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-enqueueffisdownload}.as_count() > 0"
        tags                 = [
            "env:staging",
            "service:grants-ingest",
            "team:grants",
        ]
        # (16 unchanged attributes hidden)
    }

  # datadog_monitor.ExtractGrantsGovXMLToDB-failed[0] will be updated in-place
  ~ resource "datadog_monitor" "ExtractGrantsGovXMLToDB-failed" {
        id                   = "130337502"
        name                 = "Grants Ingest (Draft - staging): ExtractGrantsGovXMLToDB failed"
      ~ query                = "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-ExtractGrantsGovDBToXML}.as_count() > 0" -> "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-extractgrantsgovdbtoxml}.as_count() > 0"
        tags                 = [
            "env:staging",
            "service:grants-ingest",
            "team:grants",
        ]
        # (16 unchanged attributes hidden)
    }

  # datadog_monitor.PersistFFISData-failed[0] will be updated in-place
  ~ resource "datadog_monitor" "PersistFFISData-failed" {
        id                   = "130337496"
        name                 = "Grants Ingest (Draft - staging): PersistFFISData failed"
      ~ query                = "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-PersistFFISData}.as_count() > 0" -> "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-persistffisdata}.as_count() > 0"
        tags                 = [
            "env:staging",
            "service:grants-ingest",
            "team:grants",
        ]
        # (16 unchanged attributes hidden)
    }

  # datadog_monitor.PersistGrantsGovXMLDB-failed[0] will be updated in-place
  ~ resource "datadog_monitor" "PersistGrantsGovXMLDB-failed" {
        id                   = "130337497"
        name                 = "Grants Ingest (Draft - staging): PersistGrantsGovXMLDB failed"
      ~ query                = "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-PersistGrantsGovXMLDB}.as_count() > 0" -> "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-persistgrantsgovxmldb}.as_count() > 0"
        tags                 = [
            "env:staging",
            "service:grants-ingest",
            "team:grants",
        ]
        # (16 unchanged attributes hidden)
    }

  # datadog_monitor.ReceiveFFISEmail-failed[0] will be updated in-place
  ~ resource "datadog_monitor" "ReceiveFFISEmail-failed" {
        id                   = "130337498"
        name                 = "Grants Ingest (Draft - staging): ReceiveFFISEmail failed"
      ~ query                = "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-ReceiveFFISEmail}.as_count() > 0" -> "sum(last_1h):avg:aws.lambda.errors{env:staging,functionname:grants_ingest-receiveffisemail}.as_count() > 0"
        tags                 = [
            "env:staging",
            "service:grants-ingest",
            "team:grants",
        ]
        # (16 unchanged attributes hidden)
    }

  # datadog_monitor.SplitFFISSpreadsheet-failed[0] will be updated in-place
  ~ resource "datadog_monitor" "SplitFFISSpreadsheet-failed" {
        id                   = "130337499"
        name                 = "Grants Ingest (Draft - staging): SplitFFISSpreadsheet failed"
      ~ query                = "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:grants_ingest-SplitFFISSpreadsheet}.as_count() > 0" -> "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:grants_ingest-splitffisspreadsheet}.as_count() > 0"
        tags                 = [
            "env:staging",
            "service:grants-ingest",
            "team:grants",
        ]
        # (16 unchanged attributes hidden)
    }

  # datadog_monitor.SplitGrantsGovXMLDB-failed[0] will be updated in-place
  ~ resource "datadog_monitor" "SplitGrantsGovXMLDB-failed" {
        id                   = "130337501"
        name                 = "Grants Ingest (Draft - staging): SplitGrantsGovXMLDB failed"
      ~ query                = "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:grants_ingest-ExtractGrantsGovDBToXML}.as_count() > 0" -> "sum(last_1h):avg:aws.lambda.errors{env:staging,handlername:grants_ingest-extractgrantsgovdbtoxml}.as_count() > 0"
        tags                 = [
            "env:staging",
            "service:grants-ingest",
            "team:grants",
        ]
        # (16 unchanged attributes hidden)
    }

  # datadog_monitor.events_failed_to_publish[0] will be updated in-place
  ~ resource "datadog_monitor" "events_failed_to_publish" {
        id                   = "130337510"
        name                 = "Grants Ingest (Draft - staging): Grant modification events failed to publish"
      ~ query                = "min(last_1h):avg:aws.sqs.approximate_number_of_messages_visible{env:staging,queuename:grants_ingest-PublishGrantEvents-dlq} > 0" -> "min(last_1h):avg:aws.sqs.approximate_number_of_messages_visible{env:staging,queuename:grants_ingest-publishgrantevents-dlq} > 0"
        tags                 = [
            "env:staging",
            "service:grants-ingest",
            "team:grants",
        ]
        # (16 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadFFISSpreadsheet"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:35" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:35/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "35" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:1382abd35c621a7a5f7ba98bc108dc1cb2b910fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:3412fc668591f05e58cb141488a5770a6223181a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "1382abd35c621a7a5f7ba98bc108dc1cb2b910fb" -> "3412fc668591f05e58cb141488a5770a6223181a"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "35" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadGrantsGovDB"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:35" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:35/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "35" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:1382abd35c621a7a5f7ba98bc108dc1cb2b910fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:3412fc668591f05e58cb141488a5770a6223181a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "1382abd35c621a7a5f7ba98bc108dc1cb2b910fb" -> "3412fc668591f05e58cb141488a5770a6223181a"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "35" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-EnqueueFFISDownload"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:35" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:35/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "35" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:1382abd35c621a7a5f7ba98bc108dc1cb2b910fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:3412fc668591f05e58cb141488a5770a6223181a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "1382abd35c621a7a5f7ba98bc108dc1cb2b910fb" -> "3412fc668591f05e58cb141488a5770a6223181a"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "35" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ExtractGrantsGovDBToXML"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:35" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:35/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "35" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:1382abd35c621a7a5f7ba98bc108dc1cb2b910fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:3412fc668591f05e58cb141488a5770a6223181a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "1382abd35c621a7a5f7ba98bc108dc1cb2b910fb" -> "3412fc668591f05e58cb141488a5770a6223181a"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "35" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistFFISData"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:35" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:35/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "35" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:1382abd35c621a7a5f7ba98bc108dc1cb2b910fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:3412fc668591f05e58cb141488a5770a6223181a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "1382abd35c621a7a5f7ba98bc108dc1cb2b910fb" -> "3412fc668591f05e58cb141488a5770a6223181a"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "35" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistGrantsGovXMLDB"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:35" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:35/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "35" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:1382abd35c621a7a5f7ba98bc108dc1cb2b910fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:3412fc668591f05e58cb141488a5770a6223181a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "1382abd35c621a7a5f7ba98bc108dc1cb2b910fb" -> "3412fc668591f05e58cb141488a5770a6223181a"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "35" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PublishGrantEvents"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:36" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:36/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "36" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:1382abd35c621a7a5f7ba98bc108dc1cb2b910fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents" -> "git.commit.sha:3412fc668591f05e58cb141488a5770a6223181a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents"
              ~ "DD_VERSION"                   = "1382abd35c621a7a5f7ba98bc108dc1cb2b910fb" -> "3412fc668591f05e58cb141488a5770a6223181a"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "36" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ReceiveFFISEmail"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:34" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:34/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "34" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:1382abd35c621a7a5f7ba98bc108dc1cb2b910fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail" -> "git.commit.sha:3412fc668591f05e58cb141488a5770a6223181a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail"
              ~ "DD_VERSION"                     = "1382abd35c621a7a5f7ba98bc108dc1cb2b910fb" -> "3412fc668591f05e58cb141488a5770a6223181a"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "34" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitFFISSpreadsheet"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:35" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:35/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "35" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:1382abd35c621a7a5f7ba98bc108dc1cb2b910fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:3412fc668591f05e58cb141488a5770a6223181a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "1382abd35c621a7a5f7ba98bc108dc1cb2b910fb" -> "3412fc668591f05e58cb141488a5770a6223181a"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "35" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitGrantsGovXMLDB"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:35" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:35/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "35" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:1382abd35c621a7a5f7ba98bc108dc1cb2b910fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:3412fc668591f05e58cb141488a5770a6223181a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "1382abd35c621a7a5f7ba98bc108dc1cb2b910fb" -> "3412fc668591f05e58cb141488a5770a6223181a"
                # (14 unchanged elements hidden)
            }
        }

        # (3 u...*[Comment body truncated]*